run/multiphaseDiffusion/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          icoMultiPhaseChangeVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;
//stopAt          nextWrite;

endTime         0.001;

deltaT          1e-4;

writeControl    adjustableRunTime;
//writeControl    timeStep;

writeInterval   0.0001;
//writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDiCo         1000000.0;

maxDeltaT       3e-7;


// ************************************************************************* //

DebugSwitches
{
    MULES           1;
    multicomponentVoFMixture 1;
}

OptimisationSwitches
{
    fileHandler collated;
}

functions
{
    #includeFunc cellMax
    #includeFunc cellMin
}