run/multiphaseDiffusion/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water 0;
    alpha.oil 0;
    alpha.air 1;
}

zones
{
    water
    {
    	type        box;

        box (-1 -1 -1) (0.0005 0.0002 1);

        values
    	{
    	    alpha.water 1;
            alpha.oil 0;
            alpha.air 0;
        };
    }

    oil
    {
    	type        box;

        box (0.0005 -1 -1) (1 0.0002 1);

        values
    	{
    	    alpha.water 0;
            alpha.oil 1;
            alpha.air 0;
        };
    }
}

// ************************************************************************* //